Tekla.Structures.Model.ControlPlane
The ControlPlane class defines a user defined (possibly magnetic) plane helping in modeling work.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ControlPlane controlPlane = new ControlPlane();
Plane plane = new Plane();
plane.Origin = new Point(6000,6000,0);
plane.AxisX = new Vector(-3000,0,0);
plane.AxisY = new Vector(0,6000,0);
controlPlane.Plane = plane;
controlPlane.IsMagnetic = true;
bool Result = false;
Result = controlPlane.Insert();
}
}

Tekla.Structures.Model.ControlPlane.Plane
The plane defining the position of the control plane.

Tekla.Structures.Model.ControlPlane.IsMagnetic
Determines whether the plane is magnetic or not.

Tekla.Structures.Model.ControlPlane.Name
The name of the control plane.

Tekla.Structures.Model.ControlPlane.#ctor
Creates a new control plane instance.
The default values are as follows:
Plane = new Plane();
IsMagnetic = false;
Name = "Plane";

Tekla.Structures.Model.ControlPlane.#ctor(Tekla.Structures.Model.Plane,System.Boolean)
Creates a new control plane instance taking the plane and magnetism as input.
P: The plane to be used.
IsMagnetic: Determines whether the plane is magnetic or not.

Tekla.Structures.Model.ControlPlane.Insert
Inserts the control plane into the model.
Returns: True on success.

Tekla.Structures.Model.ControlPlane.Select
Selects the control plane with the given ID.
Returns: True on success.

Tekla.Structures.Model.ControlPlane.Modify
Modifies the control plane with the given ID.
Returns: True on success.

Tekla.Structures.Model.ControlPlane.Delete
Deletes the control plane with the given ID.
Returns: True on success.